{

    "Loading a dataset":
	{
        "sectionOrderList":
		[
            "Default",
        ],
        "helpBySectionMap":
		{
            "Default":"A dataset is the input for the algorithms offered by Uramaki-Toolbox, and it must be loaded as a first step to get started.
					   To load a dataset both the Object file and the Ranking file must be imported using the respective buttons."
        }
    },
    "Button: Import Object File":
	{
        "sectionOrderList":
		[
            "Options",
            "Description"
        ],
        "helpBySectionMap":
		{
            "Options":"data separator: ASCII characters used as separators in the Object file (hereinafter <idata-separator>)",
            "Description":"An object file contains a list of objects (one per line) and related features. The file will be correctly parsed when conform to the following format:
						   <object-id>(<idata-separator><feature i for object-id>)+
						   
						   Empty lines or line starting with character '%' will be ignored. The first line (if prefixed with '#') can be used to specify the name of the features;
						   This line must be conform to the following format:
						   #(<name feature><space>)+
						   						   
						   The following is an example of an objet file:
						   #name caffeine milk price frequence-sold
						   0	Espresso	1	0	1.23841991341991	0.84
						   1	Cappuccino	1	1	1.79245867768595	0.88
						   2	Chai Latte	0	1	1.87472451790634	0.38
						   (<tab> is used as <idata-separator>)"
        }
    },
	"Button: Import Ranking File":
	{
		"sectionOrderList":
		[
			"Options",
			"Description"
		],
		"helpBySectionMap":
		{
			"Options":"data separator: ASCII characters used as separators in the Ranking file (hereinafter <ranking-separator>) ignore line from top: integer that specify how many lines to ignore in the parsing ignore columns from left: integer that specify how many columns to ignore in the parsing",
			"Description":"A ranking file is a list of preference instances (for given objects), where an instance is defined as a Tuple (A?B) that imply A to be preferred over B. The file will be correctly parsed when conform to the following format ((<object-id><ranking-separator>)+ )+ For each line, the object must be listed in the ascending order by preference. For example (A B C) imply (A?B) (B?C) (A?C) Instance of the same line will be considered an atomic group, and so never evaluated separately. evaluated The entire file, or even a single line can be prefixed with line or columns that can be ignored in the parsing whenever specified by the user in the parsing options. The following is an example of a ranking file 10 1 0 10 1 4 8 5 9 6 0 10 2 9 8 1 7 6 0 10 4 8 2 1 5 7 0 10 3 2 1 6 8 9 (<space> is used as <ranking-separator>, 1 line and 2 columns will need to be ignored)"
		}
	}

}